---
kind: type
id: T:Autodesk.Revit.DB.ValueParsingOptions
source: html/5e3782ee-a1ed-593d-8180-37ebf36eda83.htm
---
# Autodesk.Revit.DB.ValueParsingOptions

Options for parsing strings into numbers with units.

## Syntax (C#)
```csharp
public class ValueParsingOptions : IDisposable
```